<template>
  <div
    class="AboutPage"
    style="overflow-y: auto; height: 100%;"
  >
    <section class="AboutS">
      <h1 class="mt-5">Лексикон</h1>
      <ul>
        <div class="lead">
          <li>
            <strong>Плагин Ergo</strong> - мем в администрации. Сравним с "Игни,
            серв лёг". Из-за худшей оптимизации в мире, этот "набор кода" ронял
            сервер. Игни больше полугода не могу понять в чём проблема из-за
            чего выразился противоречиво, когда он смог подтвердить сильное
            влияние этого плагина на состояние сервера, Ergo забил болт. В
            апреле 2022 года, в течении 1 дня, Ergo переписал плагин и он стал
            намного лучше, относительного того, что было. Но мем так и остался
            мемом и теперь, когда администрация видит низкий TPS, то ржёт над
            этим, так как опять виноват плагин Ergo. Или же такой подход - "Мой
            хост настолько мощный, что может потянуть плагин Ergo на 10
            человек". Игни ржёт
          </li>
        </div>
        <div class="lead">
          <li>
            <strong>17.87 лет</strong> - мем в администрации, образовавшийся в
            одном из созвоном с парнем, который хотел должность гейм дизайнера
            (или типа того, я просто хз). Зарабатывал от 400к рублей в месяц,
            умел делать всё и вся, ваще любого разъебаться да я тебе отвечаю
            брад, но обосрался. Следя за его речью всем хотелось угорать и вся
            администрация начала его стебать, не выдавая вида. Ему сначала было
            16 лет, а потом 17, а теперь 17.87. Говорит, любит точность, но вот
            ум он не любит, вот и обосрался. "Есть" связи во всём мире. Короч,
            парень кринж, такое ЧСВ надо ток поискать. Игни не одобряет.
          </li>
        </div>
        <div class="lead">
          <li>
            <strong>Кряк</strong> - Кто куда, а я по съёбам - это кряк. Является
            техническим администратором, но ленивый шо пиздец. Благо недавно
            начал работать и вырывать проект из задницы. Игни одобряет.
          </li>
        </div>
        <div class="lead">
          <li>
            <strong>lgnl</strong> - Лгнл, правильно читается мой ник - IgnI
            (игни). Игнис (греч) - огонь. Мем появился в связи с троллингом в
            мою сторону от игрока MbosL. Противоречивая личность, но со знаниями
            во взломе клиентских программах. Игни одобряет на 50%.
          </li>
        </div>
        <div class="lead" style="padding-bottom: 100px">
          <li>
            <strong>Продам тотемы</strong> - суть лексикона заключается в том
            что человек доХУЯ умён и захотел построить ферму тотемов, а если
            тотемов много, то он выставляет на аукцион их. Аукцион не все игроки
            проверяют, поэтому игрок начинает пистаь в чат - "Продам тотемы
            (стоимость)". Игни не понял.
          </li>
        </div>
      </ul>
    </section>
    <section class="AboutS">
      <h1 class="mt-5">Команда</h1>
      <h3 class="mt-5" style="margin-top: 1rem !important">
        Меняться будет часто, но сейчас стабильна
      </h3>
      <ul>
        <div class="lead">
          <li>
            <strong>Keezo</strong> - Новый глаза сервера, который поднял его и
            ИМЕЕТ опыт в маркейтинге, рекламе и SMM. Также дизайнер неплохой, но
            некоторые работы кринжовые на мой взгяд. Хороший собеседник.
            <b v-if="passKeezo === true">Выбыл</b><b v-else>Работает</b>
          </li>
        </div>
        <div class="lead">
          <li>
            <strong>IgnI</strong> - Олдфаг, умеет ничего, чтоб он сдох.
            <b v-if="passIgnI === true">Выбыл</b><b v-else>Работает</b>
          </li>
        </div>
        <div class="lead">
          <li>
            <strong>Crack</strong> - Аля mikki99z. Чел, шарящий за нахождение
            дыр в плагинах/модах. Когда мало спит и есть - злой. Также является
            олдфагом. Работает с IgnI по сей день
            <b v-if="passCrack === true">Выбыл</b><b v-else>Работает</b>
          </li>
        </div>
        <div class="lead">
          <li>
            <strong>Quantum</strong> - Малолетний пэздюк, который отлично шарит
            в Discord ("отец дискорда"). В целом тоже хороший человек, можно
            поболтать. <b v-if="passQuantum === true">Выбыл</b
            ><b v-else>Работает</b>
          </li>
        </div>
        <div class="lead">
          <li>
            <strong>Ergo</strong> - "Разработчик" плагина на классы. Сама же
            личность мутная, чсв. Попиздеть с ним нельзя, даже пошутить, так как
            ЧСВ. Обижается, когда говоришь ему, что он ЧСВ, но он сам такое
            говорит и ничего. Короч, диагноз - ЧСВшный шизоид.
            <b v-if="passJusso === true">Выбыл</b><b v-else>Работает</b>
          </li>
        </div>
        <div class="lead" style="padding-bottom: 100px">
          <li>
            <strong>Ergo</strong> - "Разработчик" плагина на классы. Сама же
            личность мутная, чсв. Попиздеть с ним нельзя, даже пошутить, так как
            ЧСВ. Обижается, когда говоришь ему, что он ЧСВ, но он сам такое
            говорит и ничего. Короч, диагноз - ЧСВшный шизоид.
            <b v-if="passErgo === true">Выбыл</b><b v-else>Работает</b>
          </li>
        </div>
        <!-- <p>Use <a href="../sticky-footer-navbar/">the sticky footer with a fixed navbar</a> if need be, too.</p> -->
      </ul>
    </section>
    <section class="AboutS">
      <h1 class="mt-5">Термины</h1>
      <h3 class="mt-5" style="margin-top: 1rem !important">
        Будет немного трудно их понять, но стоит
      </h3>
      <ul>
        <div class="lead">
          <li>
            <strong>Codename V, A, R</strong> - Это сервера. Если догадались, то молодцы. <strong>V</strong> - Velocity, <strong>A</strong> - Auth server, <strong>R</strong> - Rampage main server.
          </li>
        </div>

        <div class="lead" style="padding-bottom: 100px">
          <li>
            <strong>Ex</strong> - ex
          </li>
        </div>
        <!-- <p>Use <a href="../sticky-footer-navbar/">the sticky footer with a fixed navbar</a> if need be, too.</p> -->
      </ul>
    </section>
  </div>
</template>

<script>
export default {
  name: "AboutPage",
  data() {
    return {
      passErgo: true,
      passKeezo: false,
      passIgnI: false,
      passJusso: false,
      passCrack: false,
      passQuantum: false,
    };
  },
};
</script>

<style lang="scss">
@import "../assets/scss/AboutPage.scss";
</style>
