<template>
<section class="AboutS">
      <h1 class="mt-5">Лексикон</h1>
      <ul>
        <div class="lead">
          <li>
            <strong>Плагин Ergo</strong> - мем в администрации. Сравним с "Игни,
            серв лёг". Из-за худшей оптимизации в мире, этот "набор кода" ронял
            сервер. Игни больше полугода не могу понять в чём проблема из-за
            чего выразился противоречиво, когда он смог подтвердить сильное
            влияние этого плагина на состояние сервера, Ergo забил болт. В
            апреле 2022 года, в течении 1 дня, Ergo переписал плагин и он стал
            намного лучше, относительного того, что было. Но мем так и остался
            мемом и теперь, когда администрация видит низкий TPS, то ржёт над
            этим, так как опять виноват плагин Ergo. Или же такой подход - "Мой
            хост настолько мощный, что может потянуть плагин Ergo на 10
            человек". Игни ржёт
          </li>
        </div>
        <div class="lead">
          <li>
            <strong>17.87 лет</strong> - мем в администрации, образовавшийся в
            одном из созвоном с парнем, который хотел должность гейм дизайнера
            (или типа того, я просто хз). Зарабатывал от 400к рублей в месяц,
            умел делать всё и вся, ваще любого разъебаться да я тебе отвечаю
            брад, но обосрался. Следя за его речью всем хотелось угорать и вся
            администрация начала его стебать, не выдавая вида. Ему сначала было
            16 лет, а потом 17, а теперь 17.87. Говорит, любит точность, но вот
            ум он не любит, вот и обосрался. "Есть" связи во всём мире. Короч,
            парень кринж, такое ЧСВ надо ток поискать. Игни не одобряет.
          </li>
        </div>
        <div class="lead">
          <li>
            <strong>Кряк</strong> - Кто куда, а я по съёбам - это кряк. Является
            техническим администратором, но ленивый шо пиздец. Благо недавно
            начал работать и вырывать проект из задницы. Игни одобряет.
          </li>
        </div>
        <div class="lead">
          <li>
            <strong>lgnl</strong> - Лгнл, правильно читается мой ник - IgnI
            (игни). Игнис (греч) - огонь. Мем появился в связи с троллингом в
            мою сторону от игрока MbosL. Противоречивая личность, но со знаниями
            во взломе клиентских программах. Игни одобряет на 50%.
          </li>
        </div>
        <div class="lead" style="padding-bottom: 100px">
          <li>
            <strong>Продам тотемы</strong> - суть лексикона заключается в том
            что человек доХУЯ умён и захотел построить ферму тотемов, а если
            тотемов много, то он выставляет на аукцион их. Аукцион не все игроки
            проверяют, поэтому игрок начинает пистаь в чат - "Продам тотемы
            (стоимость)". Игни не понял.
          </li>
        </div>
      </ul>
    </section>
</template>

<script>
export default {
name: "PlayersPage",

}
</script>

<style lang="scss">


</style>